Tekla.Structures.Model.Beam.BeamTypeEnum
The beam types.
The strip and pad footings are valid only if the material type of the beam is concrete.

Tekla.Structures.Model.Beam.BeamTypeEnum.BEAM
The beam.

Tekla.Structures.Model.Beam.BeamTypeEnum.PANEL
The panel.

Tekla.Structures.Model.Beam.BeamTypeEnum.STRIP_FOOTING
The concrete strip footing.

Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING
The concrete pad footing.

Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN
The column.